import java.sql.*;

public class DBConnection
{
    private static Connection connection;
    private static boolean exit = false;
    private static String dbName = "learn";
    private static String dbUser = "root";
    private static String dbPass = "23019088";
    private static int count = 0;

    public static Connection getConnection()
    {
        if(connection == null )
        {
            try {
                connection = DriverManager.getConnection(
                    "jdbc:mysql://localhost:3306/" + dbName +
                    "?useServerPrepStmts=false&rewriteBatchedStatements=true&useUnicode=true&useJDBCCompliantTimezoneShift=true&useLegacyDatetimeCode=false&serverTimezone=UTC" +
                             "&user=" + dbUser + "&password=" + dbPass);

                if(!exit) {
                    connection.createStatement().execute("DROP TABLE IF EXISTS voter_count");
                    connection.createStatement().execute("CREATE TABLE voter_count(" +
                            "id INT NOT NULL AUTO_INCREMENT, " +
                            "name VARCHAR(50) NOT NULL, " +
                            "birthDate DATE NOT NULL, " +
                            "count INT NOT NULL, " +
                            "PRIMARY KEY(id)," +
                            "UNIQUE KEY name_date(birthDate,name))");
                    exit = true;
                }
            } catch (SQLException e) {
                e.printStackTrace();
            }
        }
        return connection;
    }

    public static void executeMultiInsert(StringBuilder builder) throws SQLException {
        Statement stmt = getConnection().createStatement();
        String sql = "INSERT INTO voter_count(name, birthDate, count) " +
                "VALUES" + builder.toString() +
               " ON DUPLICATE KEY UPDATE count = count + 1";
        stmt.addBatch(sql);
        stmt.executeBatch();
        stmt.close();
        count++;
        System.out.println("объем сделанных записей = " + (count * 350000));
    }

    public static void printVoterCounts() throws SQLException
    {
        String sql = "SELECT name, birthDate, count FROM voter_count WHERE count > 1";
        ResultSet rs = DBConnection.getConnection().createStatement().executeQuery(sql);
        while(rs.next())
        {
            System.out.println("\t" + rs.getString("name") + " (" +
                    rs.getString("birthDate") + ") - " + rs.getInt("count"));
        }
        String sql1 = "SELECT count(*) FROM voter_count WHERE count > 1";
        ResultSet rs1 = DBConnection.getConnection().createStatement().executeQuery(sql1);
        rs.close();
    }
}

/** Время парсинга без индексов - 513551 - 8 мин
объем сделанных записей = 12500000
37 MB занимает парсер SAXParser после оптимизации */

/**
 * Время парсинга с индексами - 5623601 - 94 мин.
 * объем сделанных записей = 12500000
 * 54 MB занимает парсер SAXParser после оптимизации*/

/**
        Гришанович Гаврил (1983-05-02) - 2
        Упоров Марсель (1965-03-09) - 2
        Фигурнов Артамон (1927-09-07) - 2
        Вакорев Панфил (1955-08-15) - 2
        Зуров Валерьян (1974-04-18) - 2
        Урванин Авель (1983-01-07) - 2
        Кутыркин Мирон (1930-06-07) - 2
        Белогорлов Иустин (1929-03-13) - 2
        Вязовкин Ахмед (1931-04-01) - 2
        Дуринов Еней (1964-02-05) - 2
        Синегубов Илларион (1940-03-04) - 2
        Елчев Стефан (1996-12-05) - 2
        Гордеев Гервасий (1943-04-09) - 2
        Ежиков Баян (1949-02-03) - 3
        Генералов Филон (1962-04-01) - 2
        Звездочетов Эрий (1925-03-16) - 2
        Пашенин Рональд (1986-04-17) - 2
        Безмельницын Майслав (1965-04-23) - 2
        Девяткин Калина (1957-07-22) - 2
        Домахин Куприян (1977-09-12) - 2
        Кучков Ной (1925-03-02) - 2
        Яськив Гений (1944-12-05) - 2
        Ладыженский Гран (1944-01-16) - 2
        Усов Филофей (1965-04-28) - 2
        Асонов Агапий (1973-07-10) - 2
        Фатин Божен (1927-02-04) - 2
        Кайданов Емилиан (1973-11-22) - 2
        Брюхачев Сидор (1942-06-23) - 2
        Аглинцев Клементин (1986-06-30) - 3
        Широкобород Мокий (1968-08-24) - 2
        Чубарев Лукьян (1993-02-04) - 2
        Скржипковский Климентий (1923-05-13) - 2
        Моникин Маресий (1938-07-27) - 2
        Пьяных Мстислав (1956-07-06) - 2
        Гашунин Левий (1964-11-12) - 2
        Ергаев Антоний (1991-08-15) - 2
        Чаусский Эспер (1964-05-14) - 2
        Недочетов Аллан (1959-03-22) - 2
        Мазко Илиодор (1934-12-21) - 2
        Корнеев Антон (1933-07-15) - 2
        Лушин Либерий (1995-10-25) - 2
        Орехов Люксен (1925-12-12) - 2
        Ирхин Тимур (1968-05-13) - 2
        Безлапатов Наиль (1976-07-09) - 2
        Гурьнев Корнилий (1997-02-11) - 2
        Олябьев Зорий (1957-03-21) - 2
        Петрусевич Дион (1958-09-12) - 2
        Генулин Досифей (1960-09-14) - 2
        Цызыров Ермей (1957-05-08) - 2
        Чайка Флорентин (1973-02-13) - 2
        Андриенко Иессей (1987-06-30) - 2
        Песенников Мелетий (1960-10-18) - 2
        Тинговатов Путислав (1963-11-17) - 3
        Холунников Армений (1947-05-26) - 2
        Ясаков Феликс (1941-06-02) - 2
        Фалунин Кронид (1992-01-12) - 2
        Тронин Авенир (1996-09-27) - 2
        Коханов Вилиор (1954-03-09) - 2
        Евстюгин Тимофей (1970-11-16) - 2
        Безумов Гурьян (1996-03-27) - 2
        Черноножкин Сурен (1976-01-18) - 2
        Пятунин Кириак (1922-02-10) - 2
        Тарасьев Горазд (1927-05-12) - 2
        Студенов Помпей (1977-01-08) - 2
        Коржавин Аникей (1971-11-18) - 2
        Шишкин Сисой (1988-12-13) - 3
        Пасевич Манил (1957-04-17) - 2
        Вишняков Иулиан (1948-06-16) - 2
        Толков Миронег (1969-08-29) - 2
        Ларюхин Нестор (1978-09-17) - 2
        Баратов Далмат (1977-04-08) - 2
        Войтко Бронислав (1924-11-09) - 2
        Бугров Игнатий (1992-06-17) - 2
        Тригорьев Франк (1992-11-21) - 2
        Шарашов Асинкрит (1945-09-02) - 2
        Неронов Гарольд (1927-06-21) - 2
        Жаров Исай (1959-08-14) - 2
        Сухобоков Тигрий (1925-09-05) - 2
        Марушкевич Сава (1995-03-04) - 2
        Шеломянцев Гемелл (1954-10-19) - 2
        Фиделин Гермий (1928-04-26) - 2
        Кошкаров Потаний (1990-10-05) - 2
        Шаховский Добрыня (1972-03-15) - 2
        Воропаев Всеволод (1962-02-15) - 2
        Костоусов Кирсан (1937-12-09) - 2
        Семернин Ираклий (1982-10-27) - 2
        Радионов Ринат (1984-11-01) - 2
        Ушколов Евстигней (1983-09-03) - 2
        Тлустовский Клементин (1975-03-08) - 2
        Калинин Палладий (1996-08-28) - 2
        Корзухин Воислав (1973-02-11) - 2
        Проценко Родон (1988-08-10) - 2
        Ганюшкин Флорин (1950-08-18) - 2
        Крамарев Эдвин (1935-12-02) - 2
        Неумоин Трифон (1923-02-01) - 2
        Чернопащенко Ральф (1957-06-26) - 2
        Летнев Никандр (1965-03-03) - 2
        Ожгихин Афинодор (1943-09-02) - 2
        Полежаев Тимофей (1920-11-07) - 2
        Долматов Гедеон (1980-07-10) - 2
        Попадейкин Онуфрий (1976-01-05) - 2
        Стрельчук Эммануил (1923-06-10) - 2
        Шалгачев Ливаний (1964-08-24) - 2
        Перебейнос Оливер (1950-04-09) - 2
        Толчельников Габриэль (1987-09-02) - 2
        Супрунец Макарий (1942-02-08) - 2
        Лукин Янис (1937-11-29) - 2
        Волоснов Мечислав (1992-06-28) - 2
        Сабашников Гелиан (1941-05-18) - 2
        Подыминогин Никифор (1920-08-26) - 2
        Струнников Иакинф (1973-06-03) - 2
        Зарубин Ливерий (1961-03-13) - 2
        Плюснин Гелий (1944-04-28) - 2
        Кирдяйкин Шамиль (1943-03-15) - 2
        Тарахов Исакий (1936-08-30) - 2
        Дугин Радимир (1969-04-09) - 2
        Влазнев Изот (1929-01-17) - 2
        Веньгин Кирсан (1960-07-01) - 2
        Антипов Мечислав (1983-01-22) - 2
        Гладильщиков Доманег (1946-08-03) - 2
        Дедичев Остап (1932-04-23) - 2
        Карандышев Мирослав (1948-03-21) - 2
        Назарцев Калина (1927-06-21) - 2
        Василеха Ефим (1984-04-02) - 2
        Рудкин Виль (1969-03-10) - 2
        Бродников Мосей (1963-10-20) - 2
        Титков Леон (1968-10-01) - 2
        Вологжанин Полиен (1991-02-20) - 2
        Девятайкин Тарас (1964-10-13) - 2
        Крамской Гелий (1981-01-24) - 2
        Подкидышев Малей (1936-10-05) - 2
        Гневышев Степан (1976-06-16) - 2
        Сумников Сила (1973-01-24) - 2
        Устиников Стахий (1933-03-18) - 2
        Бизюков Конрад (1980-05-21) - 2
        Прощенков Меркурий (1960-10-12) - 2
        Юнев Кондратий (1930-02-05) - 2
        Вежливцев Валерьян (1926-11-17) - 2
        Безсонов Хрисанф (1979-05-20) - 2
        Аввакумов Исей (1993-01-15) - 2
        Карпуненко Кармий (1986-06-18) - 2
        Корнашов Ананий (1926-03-03) - 2
        Филипп Мелентий (1938-08-03) - 2
        Беззубцев Антроп (1996-05-30) - 2
        Савиткин Гордиан (1945-05-15) - 2
        Дольников Октавиан (1962-12-01) - 2
        Кулиш Эйнар (1954-02-28) - 2
        Холомин Зиновий (1971-06-05) - 2
        Северский Иов (1996-10-27) - 2
        Якубович Аллан (1938-02-18) - 2
        Юриков Кион (1978-10-30) - 2
        Симка Бронислав (1956-02-11) - 2
        Кульпин Ангий (1925-10-17) - 2
        Пахомычев Эльмир (1950-10-11) - 2
        Иссерлис Исидор (1990-06-02) - 2
        Ярных Дионисий (1997-04-13) - 2
        Корнеевец Анисим (1949-09-27) - 2
        Щербаков Манфред (1943-01-19) - 2
        Грачев Савелий (1933-08-29) - 2
        Усенков Марс (1972-07-07) - 2
        Топчий Раймонд (1935-08-30) - 2
        Трихинский Модест (1959-05-20) - 2
        Солобой Гений (1949-08-31) - 2
        Казаков Еремей (1928-08-06) - 2
        Пашенин Елима (1975-08-15) - 2
        Кречетов Ахиллий (1992-10-09) - 2
        Бабаченко Исакий (1993-04-02) - 2
        Парнасский Феофил (1954-05-01) - 2
        Карпычев Британий (1944-05-17) - 2
        Братишкин Исей (1962-01-23) - 2
        Нагорнов Елим (1956-06-10) - 2
        Гонохов Мстислав (1978-04-27) - 2
        Лавровский Юлий (1986-09-14) - 2
        Жилинский Ливий (1944-07-26) - 2
        Поленков Никодим (1957-10-31) - 2
        Земсков Семён (1948-05-04) - 2
        Ишимников Эрнест (1953-02-03) - 2
        Пархомов Твердислав (1961-09-13) - 2
        Замощин Павлин (1973-04-12) - 2
        Карачурин Михей (1928-12-05) - 2
        Палкин Сидор (1985-10-21) - 2
        Палин Лорис (1976-12-28) - 2
        Фиделин Фотий (1962-04-12) - 2
        Красноармейский Валентин (1968-11-12) - 2
        Пигалицин Ларион (1949-04-04) - 2
        Марунин Витим (1981-12-28) - 2
        Грушенков Логгин (1943-02-22) - 2
        Филаретов Лир (1974-12-28) - 2
        Наточеев Арсений (1963-03-19) - 2
        Шеболаев Аникий (1934-06-29) - 2
        Гринкин Флорин (1962-03-29) - 2
        Диев Яков (1930-10-21) - 2
        Дроботов Иулиан (1939-09-19) - 2*/
